var TosAgreement = React.createClass({
  getInitialState: function() {
    return {
      updating: false,
      user: {},
      user_loaded: false
    };
  },
  componentDidMount: function() {
    if(this.props.standalone_page && this.props.current_user_id){
      this.loadDataFromServer();
    }
  },
  loadDataFromServer: function () {
    $.ajax({
      url: '/rest/users/' + this.props.current_user_id + '.json',
      dataType: 'json',
      success: function (user) {
        this.setState({
          user: user,
          user_loaded: true
        });
      }.bind(this),
      error: function (xhr, status, err) {
        console.error('/rest/users.json', status, err.toString());
      }.bind(this)
    });
  },
  handleDisagree: function() {
    window.location = '/';
  },
  handleAgree: function(e) {
    if(this.state.updating){
      console.log('not finished yet!!!')
      return;
    }
    if(this.props.standalone_page && (!this.state.user_loaded ||this.state.user.tos_agreed)){
      return;
    }
    
    this.setState({updating: true})

    $.ajax({
      url: '/rest/users/' + this.props.current_user_id + '/tos_agree.json',
      type: "put",
      data: {},
      success: function (user) {
        if(this.props.standalone_page){
          this.setState({user: user});
        }else{
          this.props.handleAgree();
        }
      }.bind(this),
      error: function (xhr, status, err) {
        console.error('/rest/user/tos_agree', status, err.toString());
        $.growl.error({ title: '', message: "Алдаа гарлаа" , location: "br", delayOnHover: true});
      }.bind(this),
      complete: function () {
        this.setState({updating: false});
      }.bind(this)
    });
  },
  render: function(){
    return (
      <div>
        <div className="home-module-title big-title">Deal.mn сайтын үйлчилгээний нөхцөл</div>
        <p><strong>ЕРӨНХИЙ ЗААЛТ</strong></p>
        <p>Бартер буюу тохиролцоонд суурилсан Deal.mn сайт нь &ldquo;И Би Ти&rdquo; ХХК-ны эзэмшилд байх бөгөөд энэхүү үйлчилгээний нөхцөл нь уг сайтаар үйлчлүүлэх, харилцан тохиролцоо хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.</p>
        <ol start="1">
          <li>Deal.mn сайт нь олон нийтэд зориулсан МӨНГӨН ОРОЛЦООГҮЙгээр хэрэглэгч хооронд бараа үйлчилгээг солилцох боломжыг олгож буй чөлөөт, нээлттэй үнэ төлбөргүй сайт юм.</li>
          <li>Deal.mn сайт нь зөвхөн бараа, үйлчилгээгээ солилцох боломжтой хэрэглэгчдийн мэдээллийг дамжуулах зорилготой бөгөөд хэрэглэгч хоорондоо бараа, үйлчилгээг солилцох үе шаттай холбоотой асуудалд оролцохгүй болно.  </li>
          <li>Deal.mn сайт дээрх тохиролцоо нь зөвхөн үйлчилгээний нөхцөлийг хүлээн зөвшөөрсөн бүртгэлтэй хэрэглэгчдийн хооронд явагдана.</li>
          <li>Сайтад ашиглагдах тэмдэгтүүд нь &ldquo;И Би ТИ&rdquo; ХХК-ны өмч бөгөөд энэхүү вэбсайтын лого, нэр бусад загварыг хуулах, олшруулах, дуурайх, өөр бусад ямар ч зүйлд ашиглахыг хориглоно.</li>
          <li>Байгууллага вэбсайтын мэдээллийн шинэчлэл, урамшуулал болон шинэ үйлчилгээний мэдээлэл зэргийг бүрэн хариуцна.</li>
        </ol>
        <p>&nbsp;</p>
        <p><strong>НЭГ. DEAL.MN ХЭРЭГЛЭГЧ</strong></p>
        <p>1.1 Deal.mn сайтад бүртгүүлэхэд үнэ төлбөргүй. Та 18 насанд хүрсэн, эрх зүйн бүрэн чадамжтай бол deal.mn сайтад бүртгүүлж болно.</p>
        <p>1.2 Вэбсайтын ажиллагаа, түүний аюулгүй байдал, цахим худалдааны хэрэглэгчдийн мэдээллийн нууцлалыг байгууллага бүрэн хариуцна.</p>
        <p>1.3 Хэрэглэгч вэбсайтын талаар санал гомдол, шинэ санаа, шинэ бараа борлуулах хүсэлт, шүүмж зэргийг дагуу чөлөөтэй илэрхийлэх, илгээх эрхтэй.</p>
        <p>1.4 Хэрэглэгчийн мэдээллийн үнэн зөв, бодит байдалд хэрэглэгч бүрэн хариуцлага хүлээнэ.</p>
        <p>1.5 Deal..mn сайт нь бүртгэлтэй хэрэглэгчийг зөвшөөрөлгүйгээр бүртгэлийг цуцлах эрхтэй. Үүнд:</p>
        <ul>
          <li> Бусад хэрэглэгчдээс удаа дараа гомдол ирсэн.</li>
          <li>Үйлчилгээний нөхцөлийг зөрчсөн, өөр гишүүний нэр зээлдсэн, дуурайсан, таны зан авир, харьцаа хандлага шаардлага хангаагүй.</li>
        </ul>
        <p>1.6 Бүртгэлийг цуцалсан тохиолдолд хэрэглэгч дахин шинээр Deal.mn сайт бүртгэл нээхгүй, нээх оролдлого хийхгүй. Та хүссэн үедээ өөрийн бүртгэлийг цуцлаж болно. Хэрэглэгч бүртгэлээ өөрөө, эсвэл сайтын зүгээс цуцалсан тохиолдолд Deal.mn сайтыг ашиглан тохиролцоо хийх боломжгүй болно.</p>
        <p>&nbsp;</p>
        <p><strong>ХОЁР. DEAL.MN ТОХИРОЛЦОО</strong></p>
        <p>2.1 Хэрэглэгч сайтын үндсэн хэсэгт байрлах &ldquo;Тохиролцоо оруулах&rdquo; товчыг ашиглан өөрийн тохиролцох бараа, үйлчилгээний мэдээллийг оруулна.</p>
        <p>2.2 Deal.mn сайтд хэрэглэгчийн орсон тохиролцооны дараах мэдээллүүдэд сайт баталгаа өгөхгүй.  </p>
        <ul>
          <li>Аливаа бараа үйлчилгээний эзэмшлийн талаар;</li>
          <li>Үйлчилгээ хэсэгт бүртгэгдсэн аливаа бараа үйлчилгээний агууламж, аюулгүй  байдал, тайлбар, ашиг тус, чанар, хуульд нийцэх байдал зэрэг;</li>
          <li>Бүртгүүлсэн бараа үйлчилгээний үнэн зөв, бодит байдал;</li>
        </ul>
        <p>2.3 Хэрэглэгч тохиролцоохоор оруулсан бараа, үйлчилгээний доор байрлах &ldquo;Санал илгээх&rdquo; товчыг ашиглан тухайн бараа, үйлчилгээтэй тохиролцохыг хүсэж буй өөрийн бараа, үйлчилгээг оруулж хэрэглэгчид илгээнэ.</p>
        <p>2.4 Тохиролцоо оруулсан хэрэглэгч өөрт ирсэн бусад хэрэглэгчийн саналаас өөрт тохирох тохиролцооны саналыг хүлээн авч тохиролцоог хийнэ.</p>
        <p>2.5 Хэрэглэгч өөрийн барааг, үйлчилгээнд ирсэн тохиролцох саналуудаас өөрт таалагдсан барааг, тохиролцохоор саналыг хүлээн авсны дараа &ldquo;Барааг үлдээх&rdquo; аль эсвэл &ldquo;Хаах&rdquo; гэсэн сонголт гарч ирэх бөгөөд хэрэв &ldquo;Барааг үлдээх&rdquo; сонголтыг хийвэл тохиролцоо цааш үргэлжлэн дараа дараагын тохиролцооны саналыг хүлээн авах бөгөөд &ldquo;Хаах&rdquo; сонголтыг хийвэл дахин санал авах боломжгүй болж хаагдана.</p>
        <p>2.6 Хэрэглэгчийн тохиролцохоор оруулсан саналд ирүүлсэн бусад хэрэглэгчийн тохиролцох саналаас хэрэлэгч өөрийн сонголтыг хийснээр тохиролцоо хийгдсэнд тооцоно. Deal.mn сайт нь аль нэг талын төлөөлөгч биш бөгөөд, хэрэглэгч хооронд явагдах аливаа харилцаа, тохиролцоонд оролцохгүй.</p>
        <p>2.7 Тохиролцоогы явцад хэрэглэгчид хооронд үүссэн аливаа хэлцэл, тохиролцоо болон харилцаа нь бүхэлдээ хэрэглэгчдийн өөрсдийн хариуцах эрсдэл болно. Deal.mn нь аливаа нэг хэрэглэгч, хэрэглэгчдийн өмнөөс ямар нэг үүрэг хариуцлага хүлээхгүй, ялангуяа хуурамч нэрээр бүртүүлсэн, хэрэглэгчийг хуурахыг оролдсон зэрэг үйлдэлийн өмнөөс хариуцлага хүлээхгүй.</p>
        <p>2.8 Хэрэглэгч нэгэн зэрэг хэдэн ч тохиролцоо хийх боломжтой.</p>
        <p>&nbsp;</p>
        <p><strong>ГУРАВ. ХЭРЭГЛЭГЧИЙН ХҮЛЭЭХ ХАРИУЦЛАГА</strong></p>
        <p>3.1 Deal.mn сайтад байрших бүх бараа бүртгэл, санал болгох, тохиролцох, бусад харилцаа холбоо нь сайн санааны үүднээс хийгдэх ёстой.</p>
        <p>3.2 Хэрэглэгч веб сайт, үйлчилгээ, сүлжээ, түүнтэй холбогдсон систем зэрэгт ямар нэг гэмтэл, хор хөнөөл учруулахгүй, хөндлөнгөөс оролцохгүй, завдахгүй байх үүрэгтэй байна.</p>
        <p>3.3 Хэрэглэгч веб сайт, түүнтэй холбоотой үйлчилгээнд нэвтрэн холбогдохдоо аливаа нэг автомат, электрон төхөөрөмж ашиглан холбогдохыг хатуу хориглоно.</p>
        <p>3.4 Хэрэглэгч өөрийн имэйл хаяг, гар утасны дугаар болон бусад хувийн мэдээллийг тохиролцох барааны тайлбар дээр, оруулсан барааны асуулт, хариултын хэсэгт, өөрийн хувийн мэдээллийн нийтэд харагдах хэсэгт болон блогт оруулж болохгүй.</p>
        <p>3.5 3.4 заалтаас хамааралгүйгээр бусад тохиолдолд бараа, үйлчилгээ оруулахдаа тохирох нүдэнд нь өөрийн холбоо барих мэдээллийг оруулж болно.</p>
        <p>3.6 Хэрэглэгч Deal.mn-ийн веб сайтаас гадуур тохиролцоог дуусгах, эцэслэхийг хориглох бөгөөд тохиролцоо амжилттай болсоны дараа бусад хэрэглэгчдээс дахин санал ирхээс сэргийлэх үүднээс сайтаар дамжуулах тохиролцоог хаах эсвэл үргэлжүүлэхээ мэдэгдэх байх үүрэгтэй.</p>
        <p>3.7 Тохиролцоонд хийгдэж байгаа бүх үйлдэлд хэрэлэгч хариуцлага хүлээх үүрэгтэй.</p>
        <p>3.8 Хэрэглэгч Монгол улсын хууль тогтоомжийг зөрчсөн, түүнд харшлах бараа үйлчилгээг тохиролцохоор оруулахыг хатуу хориглоно.</p>
        <p>3.9 Бараа, үйлчилгээ тохиролцохоор оруулахад урьдчилсан хяналт байхгүй. Deal.mn сайт тогтмол хугацаанд шалгалт хийж зохисгүй хийж үйлчилгээний нөхцөл зөрчсөн бараа, үйлчилгээг тохиролцооноос хасах болно.</p>
        <p>3.10 Deal.mn сайтад бараа үйлчилгээг оруулж буй хэрэглэгч нь өөрийн бараа, үйлчилээг мөнгөн дүнгээр үнэлнэ. Хэрэглэгч бараа, үйлчилгээний мөнгөн үнэлгээг зориудаар өсгөх, худал үнэлгээ оруулахыг хориглоно.</p>
        <p>&nbsp;</p>
        <p><strong>ДӨРӨВ. БУСАД НӨХЦЛҮҮД</strong></p>
        <p>4.1 Deal.mn сайт нь зайлшгүй шаардлагатай засвар үйлчилгээнээс шалтгаалсан түр зогсолтоос бусад тохиолдолд уг вэбсайт болон үйлчилгээнийхээ тогтвортой ажиллагааг хангахын төлөө зохих арга хэмжээг авч ажиллана.</p>
        <p>4.2 Deal.mn сайт нь хэрэглэгчдийн хооронд хийгдэж буй тохиролцоонд оролцогч тал биш бөгөөд та энэхүү нөхцлөөр аливаа худалдаа эсвэл гүйлгээнээс үүдэн гарсан маргаан зөрчилд оролцохгүй.</p>
        <p>4.3 Deal.mn нь өөрсдийн гишүүддээ мэдээ мэдээллийг зарлах, сайт шинэчлэлт, шинэ боломжыг хүргэх зорилготой БЛОГ буланг ажлуулна.</p>
        <p>4.4 Deal.mn нь өөрийн хяналтнаас гадуур буюу өөрийн буруугаас шалтгаалаагүй үүдсэн вэбсайт болон үйлчилгээний доголдол, үйл ажиллагааны саатал зэрэгт хариуцлага хүлээхгүй болно.</p>
        <p>4.5 Хэрэв эдгээр үйлчилгээний нөхцлүүд болон заалтууд ямар нэг шалтгаанаар хүчингүй болох, мөрдөгдөх боломжгүй болох эсвэл хууль бус болсон тохиолдолд тухайн хүчингүй заалтыг хасах ба үлдсэн нөхцөл, заалтууд нь хүчинтэй хэвээр байх болно.</p>
        <p>4.6 Захирагдах хууль. Эдгээр үйлчилгээний нөхцөл заалтууд нь Монгол Улсын хууль дүрэмд захирагдах болно.</p>
        <p>4.7 Deal.mn сайт нь өөрсдийн нууцлалын журмын дагуу хэрэгэлэгчийн хувийн мэдээллийг цуглуулж, ашиглаж болно.</p>
        <p>&nbsp;</p>
        <p><strong>ТАВ. ШИНЭЧЛЭЛ</strong></p>
        <p>5.1 Энэхүү заалтууд нь өөрчлөгдөх боломжтой бөгөөд өөрчлөлтийг хэрэглэгчид мэдэгдэх үүрэг хүлээхгүй.</p>
        <p>&nbsp;</p>
        <div className="hairly-line"></div>
        {(this.props.standalone_page && this.props.current_user_id && this.state.user_loaded && !this.state.user.tos_agreed || !this.props.standalone_page && !this.props.user.tos_agreed)  && <div className="col-md-12 text-center btn-space"><button onClick={this.handleDisagree} className="btn btn-danger">Зөвшөөрөхгүй</button><button onClick={this.handleAgree} className="btn btn-success">Зөвшөөрөх</button></div>}
        <div className="clearfix"></div>
      </div>
    );
  }
});


module.exports = TosAgreement;